[
  {
    "id": 1,
    "title": "Unlocking the power of multimodal online reviews: A multisensory perspective",
    "abstract": "Multimodal online reviews have been an essential marketing tool for dominating consumer perception. However, the precise impact of visual, auditory, tactile, gustatory, and olfactory cues in multimodal content on consumers’ perceived review usefulness remains unclear. This study aims to fill this gap by exploring how text and image contents affect review usefulness from a multisensory perspective. To this end, we proposed a framework that combined machine learning and multimodal large language models to quantify the multisensory elements conveyed through review text and images. Based on the Poisson regression model, the estimation results show that while multisensory elements in text and images have a generally consistent impact on consumer perception, each sensory element carries distinct value. Furthermore, the sensory discrepancy in text and images has a negative effect on the perceived review usefulness. Our findings contribute theoretically to enhancing review persuasion effect and sensory marketing literature. © 2025 Elsevier Ltd",
    "authors": [
      "Author 1",
      "Co-Author 1"
    ],
    "keywords": [
      "Machine learning; Multimodal online reviews; Multisensory elements; Review usefulness; Sensory discrepancy"
    ],
    "year": 2025,
    "isIndustry": true,
    "rating": "not-interesting",
    "solutionSentence": "N/A",
    "laypersonSummary": "This study investigates how different types of sensory information, like text and images, in online reviews influence how useful consumers find those reviews. It develops a framework to analyze these sensory elements and their effects on consumer perception.",
    "confidenceComment": "Focus is on theoretical contributions; no specific industry problem addressed.",
    "tags": {
      "computerVision": true,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 2,
    "title": "Multimodality in tourism and hospitality: A critical and narrative review",
    "abstract": "Although multimodal data offers valuable insights for tourism and hospitality research and practice, it also poses significant theoretical and methodological challenges. Through a narrative and critical literature review, this research develops the multimodal data analytics methodological framework as a novel guiding principle to theoretically engage with multimodal data. The research identifies a number of critical issues to consider when approaching multimodal data, particularly multimodal fusion and analytical validity. It also highlights how multimodal data can be used to test, extend and develop theories in tourism, providing a roadmap for future research in pushing the boundaries of multimodal data in tourism and hospitality. © 2025 The Authors",
    "authors": [
      "Author 2",
      "Co-Author 2"
    ],
    "keywords": [
      "Machine learning; Multimodal data analytics; Multimodal fusion; Narrative review; Validity"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This paper reviews how different types of data can be used in tourism and hospitality research. It discusses the challenges and offers a framework for analyzing this data to improve understanding in the field.",
    "confidenceComment": "Focus is on theoretical and methodological aspects; no specific industry problem or product mentioned.",
    "tags": {
      "computerVision": false,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 3,
    "title": "Decoding the cultural heritage tourism landscape and visitor crowding behavior from the multidimensional embodied perspective: Insights from Chinese classical gardens",
    "abstract": "This study integrates mobile sensing technologies into a “space-perception-behavior” framework, grounded in multidimensional embodied cognition, to evaluate the spatial quality of cultural heritage tourism in classical Suzhou gardens, China. “Space” level, machine learning technology is employed for the image semantic segmentation of panoramic images to measure spatial elements. “Perception” level, text semantic segmentation analysis of various perceptions of the physical environment using social media data is conducted with SnowNLP. “Behavior” level, spatial density analysis of visitors' onsite crowd aggregation characteristics is conducted with panoramic images and online check-in data. The results reveal that the sky view index and window-to-wall ratios, along with physical microclimatic environmental factors such as temperature and humidity, significantly influence the visitors’ crowding behavior. This research contributes to developing a synergistic system to evaluate embodied cognition and spatial quality, clarifies their mutual influencing mechanisms, and provides theoretical and practical guidance for sustainable heritage tourism development. © 2025 Elsevier Ltd",
    "authors": [
      "Author 3",
      "Co-Author 3"
    ],
    "keywords": [
      "Chinese classical gardens; Cultural heritage landscapes; Multidimensional embodied cognition; Tourism spatial quality evaluation; Visitors' crowding behavior; “Space-perception-behavior”"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "A system that uses image analysis to assess visitor crowding and spatial quality in cultural heritage sites, helping to improve tourism management.",
    "laypersonSummary": "This research looks at how visitors behave in classical Chinese gardens by analyzing images and social media data. It helps understand what makes these places enjoyable and how to manage crowds better for a more pleasant experience.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 4,
    "title": "Exploring emotional aspects of travel concepts via travel photos based on contrastive language-image pretraining",
    "abstract": "Understanding travel concepts and their associated emotions is beneficial for promoting tourism destinations and attracting travelers seeking specific emotional experiences. However, few studies in tourism literature have explored the emotional aspects of travel concepts, likely due to the abstract nature of emotion, which makes capturing and analyzing emotions challenging. This paper introduces a novel method for the effective exploration of emotions associated with travel concepts through travel photos to address this gap. By leveraging a state-of-the-art computer vision technique, Contrastive Language-Image Pretraining, our method can uncover various travel concepts and their associated emotions. We demonstrate the method's effectiveness through a case study of Australia, analyzing 436,177 photos shared by 9457 users. The method and its findings are valuable for researchers and tourism managers, offering insights into the emotional aspects of travel concepts for use in tourism marketing and other applications. © 2024 The Authors",
    "authors": [
      "Author 4",
      "Co-Author 4"
    ],
    "keywords": [
      "CLIP; Emotion wheel; OpenAI; Travel concept; Zero-shot classifier"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "A tool that analyzes travel photos to identify emotions associated with different travel concepts, aiding tourism marketing efforts.",
    "laypersonSummary": "This research develops a method to understand the feelings people have about travel by analyzing photos they share. It helps tourism managers know what emotions to highlight in their marketing to attract travelers.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 5,
    "title": "AI-generated imagery in sustainable gastronomy tourism: A study from bottom-up to top-down processing",
    "abstract": "This study utilized image-based experimental methods to explore the intersection of sustainability, gastronomy tourism, and Artificial Intelligence (AI), with a focus on promoting ‘climate-conscious food’. This term refers to the food produced through eco-friendly practices. Despite the benefits of climate-conscious food for individuals, the environment, and local tourism, its adoption remains limited. Conceptualized on visual information processing, this research comprises two studies employing bottom-up and top-down processing. It confirms that the type of content in AI-generated images, specifically “Food Presentation” versus “Preparation Process,” significantly influences consumers' perceptions of food quality and their purchasing intentions. This effect is moderated by consumers' knowledge of climate-conscious food and their level of environmental concern. By providing empirical evidence analyzed through multivariate statistical techniques, this study offers valuable practical and theoretical insights into how AI can promote climate-conscious food, thereby advancing sustainable gastronomy tourism. © 2024 Elsevier Ltd",
    "authors": [
      "Author 5",
      "Co-Author 5"
    ],
    "keywords": [
      "AI-generated imagery; Bottom-up; Climate-conscious food; Gastronomy tourism; Top-down processing"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "An AI-driven platform that generates images of climate-conscious food to enhance consumer perceptions and promote sustainable gastronomy tourism.",
    "laypersonSummary": "This research looks at how pictures of food created by AI can influence people's views on eco-friendly food and their willingness to buy it. It shows that the way food is presented in these images can affect how much people care about sustainability in their food choices.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 6,
    "title": "“Big picture” predicts destination attractiveness: The role of physical breadth and contextual breadth",
    "abstract": "In global tourism, renowned attractions with diverse visual styles consistently yield positive experiences. This study introduced the ‘big picture’ metaphor as a universal visual code underlying their appeal. Drawing on the broaden-and-build theory, we proposed a two-dimensional visual breadth (2DVB) model, identifying physical breadth (expansiveness of visual fields) and contextual breadth (variety of visual contexts) as key predictors of destination ratings. A deep neural network with advanced feature recognition was developed to operationalize this model. Analyzing 588,821 photos from 120 global destinations, our analyses showed that both the physical and contextual visual breadth positively predicted destination ratings, validating the model. This approach surpassed traditional content-based methods, offering a new framework for cross-scene analysis in tourism management, guiding strategic planning and promotion. © 2024 Elsevier Ltd",
    "authors": [
      "Author 6",
      "Co-Author 6"
    ],
    "keywords": [
      "Convolutional neural network; Metaphor; Photo analysis; The big picture; The broaden-and-build theory; Tourist experience"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "A deep learning-based tool that analyzes photos of tourist destinations to predict their attractiveness based on visual breadth characteristics.",
    "laypersonSummary": "This study looks at how the variety and expansiveness of images from tourist spots can influence how appealing they are to visitors. It uses a new model to analyze a large number of photos to help tourism managers improve their marketing strategies.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 7,
    "title": "Authentic experiences and visitor stickiness: When landscapes are restored at a world natural heritage site",
    "abstract": "The reconstruction of natural heritage landscapes has aroused concern. This paper uses inductive topic analysis to extract authentic experiences and visitor stickiness. Then, fuzzy-set qualitative comparative analysis (fsQCA) is used to explore the causal relationships between them. It is found that: (1) the restoration of natural heritage landscapes provided high-quality experiences for visitors to some extent, and visitors also supported the restoration of the natural heritage site to some extent; (2) visitors' authentic experiences of restored natural heritage sites embrace environmental authenticity, brand authenticity, self-authenticity, and customized authenticity; (3) environmental authenticity and self-authenticity are important dimensions that affect visitor stickiness; and (4) visitor stickiness and lack of stickiness are formed by multiple factors, and their formation paths are not completely opposite to each other. This study expands research on authentic experiences and visitor stickiness at natural heritage sites and provides suggestions for the restoration of such sites. © 2024 Elsevier Ltd",
    "authors": [
      "Author 7",
      "Co-Author 7"
    ],
    "keywords": [
      "Authentic experiences; Restoration; Visitor stickiness; World natural heritage site"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This paper studies how restoring natural landscapes affects visitors' experiences and their likelihood to return. It identifies different types of authenticity that make visitors feel connected to these sites and suggests ways to improve their appeal.",
    "confidenceComment": "No visual data involved; no concrete industry problem addressed.",
    "tags": {
      "computerVision": false,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 8,
    "title": "Resilience agility in tourism and hospitality: Empirical research using 3D modelling",
    "abstract": "The paper presents an empirical application of the integrative model of resilience knowledge in tourism, the ReKo-Model. This study employs a quantitative method to analyse seven dimensions of resilience, with a specific focus on three areas of measurement: awareness, current implementation, and strategic cooperation. The research included obtaining virtual expert evaluations from 62 managers in the hotel industry in Germany. The interpretation of empirical findings is facilitated through the use of visualization techniques. 3D models allow for cluster and gap-analysis, providing insight into the implementation of ReKo-factors and dimensions of resilience agility. By examining how hotel-managers adapt their behaviour, the research reveals that applying resilience theory in tourism and hospitality can have transformative effects. This helps bridge strategic and expertise gaps for a more comprehensive approach to resilience agility. The research supports using a deductive approach and consolidation strategy to build resilience agility in the tourism and hospitality industry. © 2024 Elsevier Ltd",
    "authors": [
      "Author 8",
      "Co-Author 8"
    ],
    "keywords": [
      "Cluster analysis; Corporate resilience; Destination resilience; Gap-analysis; ReKo-Model"
    ],
    "year": 2025,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how hotel managers in Germany can improve their ability to adapt to challenges in the tourism industry. It uses 3D models to visualize data and understand how different factors contribute to resilience in hospitality management.",
    "confidenceComment": "Clear evidence of computer vision use; industry problem addressed, but no clear product application.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 9,
    "title": "Rally-around-the-destination? Changes in host-guest emotional solidarity after crises",
    "abstract": "Utilizing the political concept of “rally-around-the-flag”, this study takes Jiuzhai Valley as a case to construct a framework of host-guest emotional solidarity and examines the dynamics of such solidarity after an earthquake and the COVID-19 pandemic. Thematic and sentiment analyses are applied to interpret Sina Weibo data and the narratives derived from residents’ interviews as a form of triangulation. Results show that under crisis: (1) host-guest emotional solidarity includes shared beliefs, shared emotions, and interactive behaviors; (2) the short-term rally effect is emotion-driven and depends on “we-ness” relationships, emotional empathy, and place identity; (3) the long-term rally effect is value-driven and emerges when host-guest emotional empathy develops into value resonance through resource integration and relationship reconstruction. The results have implications for emotional solidarity theory and destination recovery in times of crisis. © 2024",
    "authors": [
      "Author 9",
      "Co-Author 9"
    ],
    "keywords": [
      "Crisis; Emotional solidarity; Jiuzhai Valley; Rally-around-the-flag; Sentiment analysis; Thematic analysis"
    ],
    "year": 2024,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how people feel connected to each other after crises like earthquakes and pandemics, using data from social media and interviews. It finds that shared emotions and beliefs can help strengthen these connections over time.",
    "confidenceComment": "No visual data involved; no concrete industry problem addressed.",
    "tags": {
      "computerVision": false,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 10,
    "title": "Using deep learning and visual analytics to explore hotel reviews and responses",
    "abstract": "This study aims to use computational linguistics, visual analytics, and deep learning techniques to analyze hotel reviews and responses collected on TripAdvisor and to identify response strategies. To this end, we collected and analyzed 113,685 hotel reviews and responses and their semantic and syntactic relations. We are among the first to use visual analytics and deep learning-based natural language processing to empirically identify managerial responses. The empirical results indicate that our proposed multi-feature fusion, convolutional neural network model can make different types of data complement each other, thereby outperforming the comparisons. The visualization results can also be used to improve the performance of the proposed model and provide insights into response strategies, which further shows the theoretical and technical contributions of this study. © 2020 Elsevier Ltd",
    "authors": [
      "Author 10",
      "Co-Author 10"
    ],
    "keywords": [
      "Convolutional neural network; Deep learning; Hospitality; Natural language processing; Tourism; Visual analytics"
    ],
    "year": 2020,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study analyzes a large number of hotel reviews and responses to understand how hotels can better respond to customer feedback. It uses advanced techniques to look at the language in these reviews and responses, but does not focus on a specific industry problem or solution.",
    "confidenceComment": "Focus is on linguistic analysis; no concrete business problem or product application stated.",
    "tags": {
      "computerVision": false,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 11,
    "title": "(Re)Creating spaces for tourism: Spatial effects of the 2010/ 2011 Christchurch earthquakes",
    "abstract": "This paper applies an economic geographical perspective and Niche Construction Theory (NCT) to the spatial effects of the Christchurch earthquakes on the city's tourism and hospitality spaces. An analysis of policy and planning documents, relevant reports, and twenty-four semi-structured interviews with key stakeholders forms the empirical basis. Niche Construction Theory (NCT) offers an analytical framework to interpret the environmental selection pressures and key stakeholders' responses in the evolving environment. This paper illustrates the spatial reconstruction processes pertaining to urban tourism and the related hospitality industry after a major natural disaster. Emerging themes include displacement and relocation, demographic changes and market shifts for hospitality businesses. © 2020 Elsevier Ltd",
    "authors": [
      "Author 11",
      "Co-Author 11"
    ],
    "keywords": [
      "Economic geography; Entrepreneurial resilience; Niche construction theory (NCT); Placemaking; Spatial reconstruction; Tourism crisis management; Urban renewal; Urban tourism"
    ],
    "year": 2020,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This paper examines how the Christchurch earthquakes affected the city's tourism and hospitality sectors. It looks at how businesses and policies changed in response to the disaster and discusses the challenges faced by the industry during the recovery process.",
    "confidenceComment": "Clear focus on tourism industry issues; no visual data or product implications.",
    "tags": {
      "computerVision": false,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 12,
    "title": "The effects of natural disasters on international tourism: A global analysis",
    "abstract": "Tourism is shaped by a wide range of factors and forces, including exogenous ones that have no direct link with the tourism sector. Natural disasters and unexpected events are prime examples of such determining factors, as they have profound effects on individuals and society, and as a result have the potential to affect tourism flows considerably. Several theoretical arguments exist why natural disasters and unexpected events could influence tourist destination choices. However, empirical research to confirm the nature and extent of impacts of disasters on tourism is lacking. To address this gap, this paper incorporates a dataset on natural and man-made disaster events into a model of international tourism flows to evaluate the effect of different types of disasters on international arrivals at the national level. Findings provide evidence that the occurrence of different types of event change tourist flows to varying degrees. Although in some cases a positive effect is estimated, in general the impacts are negative, resulting in reduced tourist arrivals following an event. Understanding the relationship between disaster events and tourism is helpful for destination managers who make critical decisions in relation to recovery, reconstruction and marketing. © 2020 Elsevier Ltd",
    "authors": [
      "Author 12",
      "Co-Author 12"
    ],
    "keywords": [
      "Disaster; Gravity model; Hazard; Unexpected event"
    ],
    "year": 2020,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This paper studies how natural disasters affect the number of tourists visiting different countries. It finds that disasters usually lead to fewer tourists, which is important information for those managing tourist destinations to help them recover and plan better.",
    "confidenceComment": "Clear evidence of industry relevance, but no visual data or product implications.",
    "tags": {
      "computerVision": false,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 13,
    "title": "A machine learning approach to cluster destination image on Instagram",
    "abstract": "Symbols are powerful in branding and marketing to represent tourist attractions. By bridging semiotics, marketing, and data science in the tourism context, this study uncovers the destination image based on Instagram photographs. This study constructed a novel methodological framework by evaluating different machine learning models to group textual information based on pictorial content. The results highlighted specific destination image clusters such as the wilderness and spirituality of alpine experiences. This information facilitates marketers' understanding of tourists’ preferences and movement. It also discloses blind spots that are less promoted by the marketers. © 2021 The Author(s)",
    "authors": [
      "Author 13",
      "Co-Author 13"
    ],
    "keywords": [
      "Destination image; Instagram; Machine learning; Marketing; Semiotics; Tourism photography"
    ],
    "year": 2021,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how images on Instagram can show what people think about different tourist spots. It helps marketers understand what tourists like and what places are not being promoted enough.",
    "confidenceComment": "No visual data analysis methods explicitly mentioned; focus is on marketing insights.",
    "tags": {
      "computerVision": false,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 14,
    "title": "Understanding the impact of host facial characteristics on Airbnb pricing: Integrating facial image analytics into tourism research",
    "abstract": "People rapidly and subconsciously process information from facial images. On sharing economy platforms, facial cues can provide a useful supplement to other information provided by reputation systems. Previous small-scale, rater-informed studies examining trust and attractiveness based on facial features on Airbnb found mixed support for impacts on pricing. We re-examine their impact using deep learning to classify host faces for an extensive data set of Airbnb accommodation in 10 US cities (n = 78,215). Together, trust and attractiveness contribute to almost a 5% increase in prices for Airbnb accommodation. We also test Gray's theory of motivation via the examination of pricing for different types of accommodation, finding that trust is more important in situations of smaller accommodation shared with strangers. The paper concludes with limitations and implications for research and practice. © 2020",
    "authors": [
      "Author 14",
      "Co-Author 14"
    ],
    "keywords": [
      "Attractiveness; Convolutional neural network; Deep learning; Face; Host; Image analytics; Price; Trust"
    ],
    "year": 2021,
    "isIndustry": true,
    "solutionSentence": "A pricing model for Airbnb hosts that uses facial image analytics to optimize accommodation pricing based on perceived trust and attractiveness.",
    "laypersonSummary": "This research looks at how the appearance of Airbnb hosts can affect the prices they charge for their rentals. By analyzing facial images, the study finds that hosts who are perceived as more trustworthy and attractive can charge higher prices, which can help hosts set better rates.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 15,
    "title": "Reconstruction of the relationship between traditional and emerging restaurant brand and customer WOM",
    "abstract": "Customer word of mouth (WOM) is the focus of restaurant research. However, until now, few empirical studies with integrated perspectives have explored whether traditional and emerging restaurants have different paths. To fill this research gap, Study 1 examined 546 customers of time-honored restaurants and proved that brand authenticity affects customer WOM through perceived value and brand identification. Furthermore, that process is positively moderated by cultural involvement. Study 2 conducted a survey of 571 customers in an Internet celebrity restaurant and found that brand personality could promote customer WOM through perceived coolness and brand experience. Moreover, food quality enhanced the process of coolness perception and brand experience. These findings highlight that different paths of brand characteristics lead to a high level of customer perception and brand behavior. In other words, brand psychology and brand behavior occupy different core positions in traditional and emerging restaurants. © 2021 Elsevier Ltd",
    "authors": [
      "Author 15",
      "Co-Author 15"
    ],
    "keywords": [
      "Brand authenticity; Brand personality; Cultural involvement; Temerging restaurant; Traditional restauran; WOM"
    ],
    "year": 2021,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This research looks at how different types of restaurants influence customer recommendations through their brand characteristics. It finds that traditional and modern restaurants have unique ways of affecting how customers talk about them based on factors like authenticity and personality.",
    "confidenceComment": "Clear evidence of industry relevance, but no visual data or product potential.",
    "tags": {
      "computerVision": false,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 16,
    "title": "Learning patterns of tourist movement and photography from geotagged photos at archaeological heritage sites in Cuzco, Peru",
    "abstract": "The popularity of media sharing platforms in recent decades has provided an abundance of open source data that remains underutilized by heritage scholars. By pairing geotagged internet photographs with machine learning and computer vision algorithms, we build upon the current theoretical discourse of anthropology associated with visuality and heritage tourism to identify travel patterns across a known archaeological heritage circuit, and quantify visual culture and experiences in Cuzco, Peru. Leveraging large-scale in-the-wild tourist photos, our goals are to (1) understand how the intensification of tourism intersects with heritage regulations and social media, aiding in the articulation of travel patterns across Cuzco's heritage landscape; and to (2) assess how aesthetic preferences and visuality become entangled with the rapidly evolving expectations of tourists, whose travel narratives are curated on social media and grounded in historic site representations. © 2020 Elsevier Ltd",
    "authors": [
      "Author 16",
      "Co-Author 16"
    ],
    "keywords": [
      "Anthropology and computer vision; Clustering; Geotagged photos; Heritage tourism; Peru; Visual recognition; Visuality"
    ],
    "year": 2021,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This research analyzes photos taken by tourists at historical sites in Cuzco, Peru, to understand how people move and what they like to photograph. It uses computer vision techniques to study these patterns and their relationship with social media and heritage tourism.",
    "confidenceComment": "Focus is on theoretical insights; no specific industry problem addressed.",
    "tags": {
      "computerVision": true,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 17,
    "title": "A framework for quantitative analysis and differentiated marketing of tourism destination image based on visual content of photos",
    "abstract": "Photos shared by tourists are being generated at an unprecedented speed, creating new opportunities to study tourism destination images. Nevertheless, little research has focused on the tourist's perception of images from multiple perspectives and how to construct differentiated marketing strategies that link tourists with destinations. With the support of deep-learning technology, we propose herein a quantitative analysis strategy and differentiated marketing framework driven by photo big data which contains images of tourism destinations. We draw on photos of tourism destinations shared by tourists and analyse three aspects of perceived images – composition scene, visual aesthetic quality and visual uniqueness. We further develop a set of objective image-projection schemes that integrate multiple indicators of tourism destinations to improve destination marketing. Finally, we focus on an empirical case study of Wuyuan, China. The results of the study have methodological, theoretical and practical implications for the tourism industry. © 2022 Elsevier Ltd",
    "authors": [
      "Author 17",
      "Co-Author 17"
    ],
    "keywords": [
      "Deep learning; Destination marketing; Tourism destination image; Tourist-generated content; Visual analysis"
    ],
    "year": 2022,
    "isIndustry": true,
    "solutionSentence": "A data-driven marketing tool that analyzes tourist-shared photos to create targeted marketing strategies for tourism destinations.",
    "laypersonSummary": "This paper presents a method to analyze photos taken by tourists to understand how they view different travel destinations. It aims to help tourism businesses create better marketing strategies based on these insights. The study includes a real-world example from a location in China.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 18,
    "title": "Is a picture worth a thousand words? Understanding the role of review photo sentiment and text-photo sentiment disparity using deep learning algorithms",
    "abstract": "Images have become integral to consumers' sharing of consumption experiences due to their abilities of carrying rich and vivid information. This study investigates the impacts of restaurant review photo sentiment on customers’ perceived review usefulness and enjoyment using deep learning and econometric model analysis. The results indicate that (1) reviews with photos are more useful and enjoyable than reviews without photos; (2) a U-shaped relationship exists between review photo sentiment and review usefulness, with the effect of review photo sentiment on review enjoyment being positive and linear. Moreover, the effects can be strengthened by the number of review photos while weakened by the text-photo sentiment disparity. The above findings are reinforced by a sample of restaurant online reviews written by tourists in Las Vegas. This study contributes to the electronic word-of-mouth literature as well as to the application of machine learning technologies in computer vision to tourism and hospitality research. © 2022 Elsevier Ltd",
    "authors": [
      "Author 18",
      "Co-Author 18"
    ],
    "keywords": [
      "Deep learning; Photo number; Photo sentiment; Review enjoyment; Review usefulness; Text–photo sentiment disparity"
    ],
    "year": 2022,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how photos in restaurant reviews affect how useful and enjoyable those reviews are for customers. It finds that reviews with photos are generally better, and that the feelings expressed in the photos can influence this positively or negatively.",
    "confidenceComment": "Focus is on understanding consumer behavior; no specific industry problem addressed.",
    "tags": {
      "computerVision": true,
      "industryProblem": false,
      "productPotential": false
    }
  },
  {
    "id": 19,
    "title": "Contribution of streetscape features to the hedonic pricing model using Geographically Weighted Regression: Evidence from Amsterdam",
    "abstract": "This paper aims to explore the contribution of streetscape features to Airbnb accommodation pricing, allowing hosts and tourists to benefit from a more transparent pricing scheme. To this end, a hedonic pricing model based on Geographically Weighted Regression (GWR) is estimated using the data in July and November 2020 in Amsterdam. With the semantic segmentation model Deeplabv3 trained by the Cityscapes dataset, the percentages of 4 types of pixels in the images sourced from Google Street View are measured. Three indicators representing streetscape design (greenery, enclosure, and walkability) are calculated and added to the models. The results suggest that greenery and enclosure have upward effects while walkability has a downward effect on accommodations’ prices. Moreover, accounting for spatial heterogeneity and the inclusion of streetscape related variables improve the model fit by increasing adjusted R-squared and reducing residual sum of squares. © 2022 Elsevier Ltd",
    "authors": [
      "Author 19",
      "Co-Author 19"
    ],
    "keywords": [
      "Geographically weighted regression; Hedonic pricing model; Semantic segmentation; Spatial heterogeneity; Streetscape"
    ],
    "year": 2022,
    "isIndustry": true,
    "solutionSentence": "A pricing analysis tool for Airbnb hosts that uses streetscape features from Google Street View images to optimize accommodation pricing based on local environmental factors.",
    "laypersonSummary": "This research looks at how features of the streets, like greenery and walkability, affect the prices of Airbnb rentals in Amsterdam. It uses images from Google Street View to help hosts set better prices based on these factors.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 20,
    "title": "Seeing is believing? Data mining to create a choice-based conjoint approach for restaurant mobile marketing",
    "abstract": "We propose an online impression-management conceptual model and present a two-step approach to unfold the importance of multiple attributes on a restaurant marketplace mobile app. First, our study uses OpenTable platform data to provide insights into the visual attractiveness of restaurant images. In total, 92,934 images were scraped and further labeled through the Tencent Multi-Label API, which identified six categories of image cues. Second, an exploratory Choice-Based Conjoint (CBC) analysis was performed to assess the importance of attributes at different levels from 746 valid survey responses. Furthermore, we performed Latent Class Analysis (LCA) to categorize the consumers by their choice features in which we identified two groups: “visual-image-cues responsive” and “price-rating-cue responsive.” These categories advance the proposed online impression-management conceptual model and indicate that visual information is the most important attribute in decision making. Our study provides empirically based suggestions to enable practitioners to strengthen their m-commerce marketing strategies. © 2022 Elsevier Ltd",
    "authors": [
      "Author 20",
      "Co-Author 20"
    ],
    "keywords": [
      "Conjoint analysis; Deep learning object detection; Image recognition; Latent class analysis; Mobile restaurant reservation"
    ],
    "year": 2022,
    "isIndustry": true,
    "solutionSentence": "A mobile marketing strategy that leverages visual data from restaurant images to enhance consumer decision-making in the restaurant marketplace.",
    "laypersonSummary": "This research analyzes a large number of restaurant images to understand how their visual appeal affects customer choices on a mobile app. It provides practical advice for restaurants to improve their marketing based on what attracts customers visually.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 21,
    "title": "Can craft beverages shape a destination's image? A cognitive intervention to measure pisco-related resources on conative image",
    "abstract": "Assessing potential tourists' perceptions is vital to build a destination image and brand capable to attract new and repeated visitors. The increasing popularity of craft beverage tourism in recent years is incentivizing destinations to (re)design their offerings and (re)brand their image based on their craft beverages. This study investigated how the image of an emerging craft beverage tourism destination (Ica, Peru) is formed among potential tourists by inducing cognitive image (knowledge presented through picture-text dyads) of Ica's iconic resources, staple craft beverage (pisco), and resources associated with its production. Additionally, it measured the impact of local resources' characteristics, affective image, and personal characteristics on conative image (interest to visit and willingness to recommend) at different intervention stages. Results indicate that pisco-related resources are powerful enough to motivate travel, and that the characteristics of a mix of resources should be combined with beverage-specific information when developing branding strategies for craft beverage tourism destinations. © 2022",
    "authors": [
      "Author 21",
      "Co-Author 21"
    ],
    "keywords": [
      "Affective image; Cognitive image; Craft beverage tourism; Emerging destination; Induced knowledge"
    ],
    "year": 2023,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how craft beverages, like pisco, can influence people's desire to visit a place. It finds that showcasing local drinks and their production can help attract tourists to destinations like Ica, Peru.",
    "confidenceComment": "Clear evidence of industry problem addressed; no visual data or product development mentioned.",
    "tags": {
      "computerVision": false,
      "industryProblem": true,
      "productPotential": false
    }
  },
  {
    "id": 22,
    "title": "Aesthetics of hotel photos and its impact on consumer engagement: A computer vision approach",
    "abstract": "Visual content has been an essential marketing approach to exerting enjoyable virtual experiences and inducing consumer engagement. However, despite the widespread acknowledgment of the importance of visual content, how would the exerted aesthetic perception affect consumer engagement is still unexplored. Adopting a deep convolutional neural network model, this study quantifies the aesthetics of thumbnail images and managerial photos of hotels and thereby explores the impact of hotel photo aesthetics on consumer engagement. Aesthetically enjoyable photos are shown effective not only to encourage more consumers to engage in word-of-mouth discussions but also to promote consumer ratings. Such impact is also significantly moderated by hotel price. This study illustrates a viable approach to probing the perceived aesthetics of visual content in the hospitality field, and the uncovered significant role of aesthetics highlights the necessity of further attention to the cognitive perceptions of visual marketing content in both theoretical research and practical management. © 2022 Elsevier Ltd",
    "authors": [
      "Author 22",
      "Co-Author 22"
    ],
    "keywords": [],
    "year": 2023,
    "isIndustry": true,
    "solutionSentence": "A tool that analyzes hotel photos using deep learning to assess their aesthetic appeal and predict consumer engagement outcomes.",
    "laypersonSummary": "This research looks at how the beauty of hotel photos affects how much people talk about and rate those hotels. It uses computer technology to measure the aesthetics of these images and shows that nicer photos can lead to more consumer interest.",
    "confidenceComment": "Clear evidence for all labels.",
    "tags": {
      "computerVision": true,
      "industryProblem": true,
      "productPotential": true
    }
  },
  {
    "id": 23,
    "title": "Impacts of user-generated images in online reviews on customer engagement: A panel data analysis",
    "abstract": "Visual content has become an integral component of customers’ experience sharing, with customers increasingly searching for visual content in online reviews prior to making purchases. This study examines the effects of customer-generated images in online reviews on subsequent customer engagement using a multimethod design combining computer vision technique and panel data analysis. Based on online review data for 300 restaurants, findings revealed the following: 1) the ratio of pictorial reviews positively influenced subsequent review volume and average review length, whereas the effect on subsequent review valence was not significant; 2) review text–photo sentiment disparity had a complex impact on customer engagement (i.e., an inverse U-shaped relationship with subsequent review volume and a positive and negative linear relationship with subsequent average review length and review valence, respectively); and 3) business price level could mitigate the above effects. This study contributes to the literature on electronic word of mouth and customer engagement. © 2023 Elsevier Ltd",
    "authors": [
      "Author 23",
      "Co-Author 23"
    ],
    "keywords": [
      "Customer engagement; Customer-generated images; Machine learning; Online review; Panel data"
    ],
    "year": 2024,
    "isIndustry": true,
    "solutionSentence": "N/A",
    "laypersonSummary": "This study looks at how images shared by customers in online reviews affect other customers' engagement with those reviews. It finds that having more pictures in reviews can lead to longer and more frequent reviews, but the overall sentiment of the reviews is not significantly affected.",
    "confidenceComment": "Clear evidence of computer vision use, but no explicit industry problem addressed.",
    "tags": {
      "computerVision": true,
      "industryProblem": false,
      "productPotential": false
    }
  }
]